smartinou/map/projects/beastfeedher/firmware/builds/lm3s6965/BSP.cpp
        return std::make_unique<TB6612>(lIn1, lIn2, lPWM);
    }


    std::unique_ptr<SSD1329> CreateDisplay() {
        GPIO lOLEDCSnPin(GPIO_PORTA_BASE, GPIO_PIN_3);
        GPIO lDCnPin(GPIO_PORTC_BASE, GPIO_PIN_7);
        GPIO lEn15VPin(GPIO_PORTC_BASE, GPIO_PIN_6);
        static unsigned int const sDisplayWidth = 128;
        static unsigned int const sDisplayHeight = 96;

        auto lDisplay = std::make_unique<SSD1329>(
            *mSPIDev,
            lOLEDCSnPin,
            lDCnPin,
            lEn15VPin,
            sDisplayWidth,
            sDisplayHeight
        );
        return lDisplay;
    }

    EthernetAddress GetMACAddress(void) {
        // For the Stellaris Eval Kits, the MAC address will be stored in the
        // non-volatile USER0 and USER1 registers. These registers can be read
        // using the FlashUserGet function, as illustrated below.
        unsigned long lUser0 = 0;
        unsigned long lUser1 = 0;
        FlashUserGet(&lUser0, &lUser1);

        // Convert the 24/24 split MAC address from NV ram into a 32/16 split MAC address.
        EthernetAddress lMAC(
            static_cast<uint8_t>((lUser0 & 0x000000FFL) >>  0),
            static_cast<uint8_t>((lUser0 & 0x0000FF00L) >>  8),
            static_cast<uint8_t>((lUser0 & 0x00FF0000L) >> 16),
            static_cast<uint8_t>((lUser0 & 0xFF000000L) >> 24),
            static_cast<uint8_t>((lUser1 & 0x000000FFL) >>  0),
            static_cast<uint8_t>((lUser1 & 0x0000FF00L) >>  8)
        );

        if (lMAC.IsValid()) {
            return lMAC;
        }

        return EthernetAddress(0x00, 0x50, 0x1d, 0xc2, 0x70, 0xff);
    }

    std::unique_ptr<CoreLink::SSIPinCfg> mSSIPinCfg;
    std::unique_ptr<CoreLink::SPIDev> mSPIDev;
    std::unique_ptr<DS3234> mRTCC;
    std::shared_ptr<RTCC::AO::RTCC_AO> mRTCCAO;
    std::shared_ptr<FileLogSink_AO> mFileLogSink;
    std::unique_ptr<TB6612> mMotorControl;
    std::shared_ptr<PFPP::AO::Mgr_AO> mPFPPAO;
    std::unique_ptr<SSD1329> mDisplay;
    std::shared_ptr<Display::AO::Mgr_AO> mDisplayMgrAO;
    std::shared_ptr<SDC> mSDC;

    static GPIO const mRTCCInterruptPin;
};

} // namespace BSP

// *****************************************************************************
//                            FUNCTION PROTOTYPES
// *****************************************************************************

namespace BSP {
static void InitEtherLED(void);
static void InitUserLED(void);
static void SetUserLED(void);
static void ClrUserLED(void);
} // namespace BSP

// *****************************************************************************
//                             GLOBAL VARIABLES
// *****************************************************************************

#ifdef Q_SPY
// For local extern "C" functions, not part of any namespace.
static QP::QSTimeCtr QS_tickTime_ = 0;
static QP::QSTimeCtr QS_tickPeriod_ = 0; //SystemCoreClock / BSP_TICKS_PER_SEC;

// event-source identifiers used for tracing
static uint8_t const sSysTick_Handler      = 0U;
static uint8_t const sGPIOPortA_IRQHandler = 0U;

#endif // Q_SPY


// Button class should become GPIO class.
GPIO const BSP::Factory::mRTCCInterruptPin(GPIO_PORTA_BASE, GPIO_PIN_6);


namespace BSP {

// Those variables are used locally in various stubs and IRQ handlers.
static Button const mManualFeedButton(GPIO_PORTC_BASE, GPIO_PIN_4, INT_GPIOC, 0);
static Button const mTimedFeedButton(GPIO_PORTD_BASE, GPIO_PIN_4, INT_GPIOC, 0);
static Button const mSelectButton(GPIO_PORTF_BASE, GPIO_PIN_1, INT_GPIOF, 0);

static GPIO const sUserLEDPin(GPIO_PORTF_BASE, GPIO_PIN_0);
} // namespace BSP

// *****************************************************************************
//                            EXPORTED FUNCTIONS
// *****************************************************************************

namespace BSP {

std::unique_ptr<IBSPFactory> Init(void) {
    // NOTE: SystemInit() already called from the startup code,
    // where clock already set (CLOCK_SETUP in lm3s_config.h)
    // SystemCoreClockUpdate() also called from there.
    // Settings done for 50MHz system clock.
#if 0
    SysCtlClockSet(
        SYSCTL_SYSDIV_1
        | SYSCTL_USE_OSC
        | SYSCTL_OSC_MAIN
        | SYSCTL_XTAL_8MHZ
    );
#endif

    // Enable the clock to the peripherals used by the application.

    // Enable all required GPIO.
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOA);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOB);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOC);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOD);
    //SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOE);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOF);
    //SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOG);
    //SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOH);

    // Debug UART port.
    GPIO lU0RxGPIO(GPIO_PORTA_BASE, GPIO_PIN_0);
    GPIO lU0TxGPIO(GPIO_PORTA_BASE, GPIO_PIN_1);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_UART0);
    GPIOPinTypeUART(lU0RxGPIO.GetPort(), lU0RxGPIO.GetPin() | lU0TxGPIO.GetPin());
    //UARTStdioInit(0);
    // Enable UART0:
    // @115200, 8-N-1.
    // Interrupt on rx FIFO half-full.
    // UART interrupts: rx and rx-to.
    // Flush the buffers.
    UARTConfigSetExpClk(
        UART0_BASE,
        SysCtlClockGet(),
        UART_BAUD_RATE,
        (UART_CONFIG_PAR_NONE
        | UART_CONFIG_STOP_ONE
        | UART_CONFIG_WLEN_8)
    );
    UARTFIFOLevelSet(UART0_BASE, UART_FIFO_TX1_8, UART_FIFO_RX4_8);
    UARTEnable(UART0_BASE);

    // Enable interrupts.
    UARTIntDisable(UART0_BASE, 0xFFFFFFFF);
    UARTIntEnable(UART0_BASE, UART_INT_RX | UART_INT_RT);
    IntEnable(INT_UART0);

    // Initialize the QS software tracing.
    if (0U == QS_INIT(nullptr)) {
        Q_ERROR();
    }
    QS_OBJ_DICTIONARY(&sSysTick_Handler);
    QS_OBJ_DICTIONARY(&sGPIOPortA_IRQHandler);
    //QS_OBJ_DICTIONARY(&sGPIOPortC_IRQHandler);
    //QS_OBJ_DICTIONARY(&sGPIOPortD_IRQHandler);
    //QS_OBJ_DICTIONARY(&sGPIOPortF_IRQHandler);

    std::unique_ptr<IBSPFactory> lFactory(new Factory);
    return lFactory;
}


}  // namespace BSP

// *****************************************************************************
//                              LOCAL FUNCTIONS
// *****************************************************************************

